artillery/load-test.yml
# 🧪 ARTILLERY LOAD TESTING
# Performance testing configuration
# Semana 8 - Load Testing

config:
  target: 'http://localhost:3000'
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm up"

    # Ramp-up phase
    - duration: 120
      arrivalRate: 10
      rampTo: 50
      name: "Ramp up load"

    # Sustained load
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"

    # Spike test
    - duration: 60
      arrivalRate: 100
      name: "Spike"

  # Performance thresholds
  ensure:
    maxErrorRate: 1
    p95: 500
    p99: 1000

scenarios:
  - name: "Homepage Load"
    flow:
      - get:
          url: "/"
      - think: 2

  - name: "API Health Check"
    flow:
      - get:
          url: "/api/health"
          expect:
            - statusCode: 200

  - name: "Login Flow"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "test@example.com"
            password: "password123"
      - think: 1

  - name: "Get Students"
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "admin@bge.edu.mx"
            password: "admin123"
          capture:
            - json: "$.token"
              as: "authToken"
      - get:
          url: "/api/students"
          headers:
            Authorization: "Bearer {{ authToken }}"